{
  "button": {
    "delete": "Delete",
    "edit": "Edit",
    "add": "Add",
    "cancel": "Cancel"
  },
  "menu": {
    "edit": "Edit",
    "delete":"Delete",
    "copy": "Make a copy",
    "download": "Download",
    "deleteFeature": "Delete this feature",
    "addStakeholder": "Add a stakeholder",
    "addPrecondition": "Add a preconditon",
    "deletePrecondition": "Delete this preconditon",
    "addExample": "Add another situation",
    "deleteExample": "Delete this situation",
    "noExample": "No situation",
    "noStakeholder": "No stakeholders yet"
  },
  "toolbar": {
    "name": "EbA-UIM",
    "projects": "Projects",
    "method": "EbA method",
    "about": "About"
  },
  "languages": {
    "est": "EST",
    "eng": "ENG"
  },
  "addProject": {
    "title": "New project",
    "input": "Project name",
    "placeholder": "Project name"
  },
  "projectsTable": {
    "title": "Projects",
    "seeMore" : "See more ->"
  },
  "deleteProjectModal": {
    "title": "Delete projekt: {{name}}",
    "body": "Are you sure you want to delete the project?"
  },
  "deleteFeatureGroupModal": {
    "title": "Delete feature group",
    "body": "Are you sure you want to delete the feature group?"
  },
  "deleteStakeholderModal": {
    "title": "Delete stakeholder",
    "body": "Are you sure you want to delete the stakeholder?"
  },
  "editProjectModal": {
    "title": "Edit project name",
    "input": "Project name"
  },
  "editFeatureGroupModal": {
    "title": "Edit feature group name",
    "input": "Feature group name"
  },
  "editStakeholderModal": {
    "title": "Edit stakeholder name",
    "input": "Stakeholder name"
  },
  "addGroup": {
    "title": "Add a new table tab",
    "list": "Existing table tabs",
    "input": "Table tab name",
    "placeholder": "Enter feature ID or abbreviation"
  },
  "addStakeholder": {
    "title": "Add a new stakeholder",
    "list": "Existing stakeholders",
    "input": "Stakeholder name",
    "placeholder": "Enter the name in plural"
  },
  "table": {
    "newRow": "Add new row",
    "deleteRow": "Row deletion",
    "delete": "Delete",
    "edit": "Edit",
    "save": "Save",
    "cancelEdit": "Cancel editing"
  },
  "select": {
    "chooseOption": "Choose",
    "yes": "Yes",
    "no": "No",
    "dontKnow": "Don't know",
    "partly": "Partly"
  },
  "methodCombinations": {
    "YES": "Yes",
    "NO": "No",
    "DONT_KNOW": "Don't know",
    "PARTLY": "Partly"
  },
  "plan": {
    "": ""
  },
  "about": {
    "header": "About",
    "section1Heading": "EbA Method",
    "section1Text": "The motivation for creating the Experience-based Analysis (EbA) method is to make the development of digital products and services more cost effective, since EbA method provides an early indication in digital product or e-service development of whether the solution will function efficiently in terms of stakeholders' behavior and habits, and identify potential risks that may arise. The EbA method was invented by Anu Piirisild, who first described the method in 2021. in his master's thesis, but continues to research and improve the method in his doctoral studies at the University of Tartu. The method is currently in the testing phase. We would appreciate it if you could share with us your experience with the EbA method and the tool. Please send your feedback to the e-mail address ",
    "section2Heading": "EbA method tool EBA-UIM tool",
    "section2Text": "<b>The EBA-UIM tool</b> was created to make using the Experience-based Analysis (EbA) method easier. The tool helps structure the information and automatically displays the descriptions predicting the usability of the product/e-service under development.<br></br>In the tool, you can create projects, make copies, and download them in Excel format. You can visually modify the analyzed information in the downloaded Excel file according to your needs. The tool also contains a fictional example project, a description of the EbA method, and a guide to using the method. Currently, the tool is available in two languages: Estonian and English.<br></br><b>EBA-UIM tool</b> is an offline desktop application that stores the data on the user’s own machine. The application is hosted in the High Performance Computing Center of the University of Tartu. The application is free of charge to be used by anyone. EbA meetodi ja töövahendi ÕIGUSED KUULUVAD….<br></br>The tool is planned to be updated, so we recommend you visit the updated version occasionally. Information about the updated version and download can be found on the page of the High Performance Computing Center of the University of Tartu:.....",
    "section3Heading": "The EBA-UIM tool team",
    "section3Text": "<b>EBA-UIM tool</b> application is a improved version of the previous MVP (minimum viable product) version of the EbA method tool. <b>EBA-UIM tool</b> rakenduse on arendanud Tartu Ülikooli …. eriala tudengid Iris Kreinin ja Karl Olaf Kuldmaa oma bakalaureuse lõputöö raames. Iris Kreinin lõi rakenduse ………………………... Karl Olaf Kuldmaa …………………………. Anu Piirisild created the EbA method guide, texts explaining the method, and an example project.",
    "contact": "Contact",
    "address": "University of Tartu<br></br>Institute of Computer Science<br></br>Narva mnt 18<br></br>51009 Tartu, Estonia"
  },
  "combinations": {
    "header": "Combined answers",
    "section1Heading": "1. Combinations",
    "section1Text": "In the table below, you can find all the combinations of four questions and four answers. There are 256 combinations in total. One more description has been added to the 256 combinations in case a previously experienced example has not been found for comparison.<br></br>An interpretation is provided for each combination that forms a part of the sentence to which the stakeholder's name is added to the sentence along with the feature precondition (see under label “EbA Method“) . Combined into one sentence, the sentence provides an indication to what extent the stakeholders' actions meet the expectations described in the precondition.<br></br>The combinations are interpreted by Anu Piirisild.<br></br>Variants of combinations and their wording are as follows:",
    "section2Heading": "2. Interpretation of combinations",
    "section2SubHeading": "2.1. How to read the answers of the combinations in the EbA method tool",
    "section2Text": "The results can be read in different ways, according to which one feels more applicable:<br></br><ol><li>Look at the triple column “To what extent the preconditions are met“, where each part of the sentence is listed in a separate column: interpretation of the combination of answers + stakeholder + feature precondition. Such a sentence display is preferred for those who want to read the result as a whole sentence but, at the same time, keep each part of the sentence in a separate column.</li><li>Look at the 3-part sentence joined together. In the EbA method tool, the sentence is located after the triple column “To what extent the preconditions are met“. This sentence display is intended for those who want to read the result as a complete sentence without separating the parts of the sentence. We recommend using this column when the results of the analysis are included in the project documentation, and there is a desire to indicate the input for the decisions of the action plan, i.e., what the result of the EbA analysis was. In the EbA tool, this sentence column can be hidden.</li><li>Look at the yes-partly-no-don't know answers to the four questions independently, without the interpretation, and the included stakeholder group with the feature precondition, and give your own interpretation of the situation.</li></ol>",
    "section2SubHeading2": "2.2. The principles of creating the formulation for combinations",
    "section2Text2": "When interpreting the combinations, it has been ensured that i) the sentence contains the most essential aspects of the situation and the result gives meaningful information; ii) syntax of the sentence would allow linking to it the stakeholder and feature precondition without changing the wording; iii) the sentence can be used for different types of preconditions; iiii) repeated elements can be used in the sentence.<br></br>The answers are intended to cover different types of assumptions universally, e.g., knowledge, awareness, attitudes, skills, emotions, and availability of tools or activities. Therefore, the answers should be read with some abstraction.<br></br>The following the principles of interpretation and repeated elements used in the sentences are described.",
    "selection1Heading": "2.2.1. The same stakeholder? – interpreting the answers in a sentence",
    "selection1Yes": "In the case of the answer “Yes”, the stakeholder is not mentioned in the sentence because the answer describing the situation gives itself the concept that the information applies to the entire stakeholder group.",
    "selection1Partly": "The answer “Partly” means that the example of the previous experience situation provided for comparison in the EbA method applies to some of the stakeholders' representatives. Therefore, we can draw conclusions about some stakeholder representatives only. The word “some“ is used in this case in the sentence. However, an exception is made if the answer to the purposeful use is “No“ or “Don't know“. In such a case, the answer is generalized to the entire stakeholder group of the situation because even if the smaller number of the whole stakeholder group did not act according to the purpose (answer “No”), or the result of the action was not known (answer “Don't know”), we cannot assume that the action in the created product will be purposeful.",
    "selection1No": "If the answer is “No”, the sentence indicates that “there is a different stakeholder” about whom we have information, which should direct the reader to look at the actions of another stakeholder group to learn from there. However, the sentence reminds us that we don't know about the actual stakeholder, whether the prerequisite is met or not.",
    "selection1DontKnow": "If the answer is “Don't know”, the sentence indicates that “there is a stakeholder” about whom we have information, although this stakeholder cannot be defined at the moment. The answer should direct the reader to define the stakeholder more precisely, if necessary, to learn from the experience there. However, the sentence reminds us that we don't know about the actual stakeholder, whether the prerequisite is met or not.",
    "selection2Heading": "2.2.2. The same context? – interpreting the answers in a sentence",
    "selection2Yes": "In the case of the answer “Yes”, the context exactness is not mentioned in the sentence because the answer gives itself the concept that there are no differences in context.",
    "selection2Partly": "The answer “Partly” indicates that the information applies to a “slightly different context”.",
    "selection2No": "If the answer is “No”, the sentence uses the expression “in another context”, which should direct the reader to look at these other contexts to take a good or a warning example from there.",
    "selection2DontKnow": "If the answer is “Don't know”, the sentence uses the expression “in an unknown context”, which should direct the reader to learn more about this unknown context to take a good or a warning example from there.",
    "selection3Heading": "2.2.3. Purposeful use? – interpreting the answers in a sentence",
    "selection3Yes": " In the case of the answer “Yes”, the action outcome is not mentioned in the sentence if the stakeholder is the same (answer “Yes”), or partly the same (answer “Partly”). It is expressed this way because the answer gives itself the concept that the action outcome is purposeful. If the answer to the question “The same stakeholder?” is “No”, or “Don't know”, the action outcome is shown in the sentence as purposeful.",
    "selection3Partly": "The answer “Partly” is expressed in the sentence with the wording “to an extent”, which means that the scope, quality, or activity of the action meets the expectations only partially.",
    "selection3No": "If the answer is “No”, the sentence uses the expression “the action outcome is incorrect”. If the answer is “no”, the sentence also contains a reminder that based on the current information, we cannot assume that the actions will be purposeful while using the new product. This, in turn, means that the purposefulness of the stakeholder's actions must either be analyzed further or prepared for testing.",
    "selection3DontKnow": "The answer “Don't know” is expressed in the sentence with the wording “the action outcome is unknown”. If the action outcome is not known, the sentence also contains a reminder that based on the current information, we cannot assume that the actions will be purposeful while using the new product. This, in turn, means that the purposefulness of the stakeholder's actions must either be analyzed further or prepared for testing.",
    "selection4Heading": "2.2.4. Satisfied with the solution? – interpreting the answers in a sentence",
    "selection4Yes": " In the case of the answer “Yes”, satisfaction is not mentioned in the sentence because the answer describing the situation gives the concept that there is no problem with satisfaction.",
    "selection4Partly": "The answer “Partly” is expressed in the sentence with the wording “there is somewhat dissatisfaction with this precondition”, which means that there are some problems with satisfaction.",
    "selection4No": "If the answer is “No”, the sentence uses the expression “there is dissatisfaction with this precondition”. Such information should direct the reader to find a different solution, with which the probability of satisfaction would be higher.",
    "selection4DontKnow": "The answer “Don't know” is expressed in the sentence with the wording “satisfaction with this precondition is unknown”. Such information should direct the reader to determine satisfaction either through further analysis or testing with users."
  },
  "method": {
    "general": {
      "example": "Example"
    },
    "intro": {
      "title": "EbA Method",
      "header": "Experience-based Analysis (EbA) Method",
      "area": "What is the EbA method?<br></br>How to apply the EbA method?<br></br>What do you need to know when using the EbA method?",
      "text": "The Experience-based Analysis (EbA) method has been created to provide an early indication in digital product or e-service („product“ hereafter) development of whether the solution will function efficiently in terms of stakeholders' behavior and habits, and identify potential risks that may arise. Requirements validation usually focuses on finding out whether the product being developed meets the needs of the stakeholders. However, the purpose of EbA is to find out to what extent the stakeholders have the expected knowledge, skills, habits, or means necessary for the success of the product. EbA method is based on the premise that people behave according to experiential patterns.<br></br>EbA is a usability inspection method that can be used as soon as a new solution is described. Using the EbA method, you can validate your vision of the solution, whether it would work as such, or if it would be reasonable to change the requirements, or should some aspects be analyzed further. An early analysis gives an overview of the situation before the requirements are handed over for prototyping, user-testing and development. For EbA, the solution descriptions can be statements about what the users can do or have to do, user stories, use cases, scenarios, process descriptions, general descriptions of the solution of the business analysis or from the strategy document, journey map data, functional goals of goal models, or other similar input that describes the planned solution and the intended kinds of users.<br></br>EbA is intended to be used by the people who elicit the requirements. In addition to requirements engineers, the EbA method is also intended for use by product owners, business analysts, etc.<br></br>Figure 1 displays the framework of the EbA method. The figure shows the components required for the analysis and the analysis process. In the EbA method, the description of the planned solution should first be divided into features. Then, decide which stakeholders are involved in the feature and what preconditions are expected from stakeholders within this specific feature to make this feature efficient. For each precondition, find an example of a situation that identifies with the precondition and that the stakeholder has experienced in the past. Next, validate to what extent the feature precondition and example situation are comparable by stakeholder and context, and evaluate whether the stakeholder's behavior was purposeful and what the satisfaction level of the stakeholder was in the comparable situation. The EbA method combined an answer that  – based on the stakeholder's previous actions  – describes the extent to which the precondition has been met. These answers help to decide whether the preconditions are met sufficiently for the solution to work successfully or not and are helpful in planning further actions."
    },
    "step1": {
      "header": "Step 1. Divide the description of the planned solution into features",
      "text": "Divide the solution of the product/e-service („product“ hereafter) into features and split each feature into a separate line. (See Fig. 2). Each feature should represent one or more logically related solution capabilities that provide value to a stakeholder and support the purpose for which the product is being created. In addition to describing the interactions and the product itself, describe aspects that represent the product more generally. For example, describe the wider context of the product and its dependencies on other services and processes that the product under development is affecting, or that affect your product. If you see that product principles involve stakeholders, include product principle descriptions as well.",
      "example": "Let us assume that the platform of an e-service needs to be complemented so that the customers of the e-service could upload files onto the platform instead of sending them separately by e-mail. The product owner of the e-service expresses his opinion as follows: “The platform does not need to limit the format of the files customers upload because, anyway, the customers use common software packages. However, the file to be uploaded should be limited to one file and the size of the file can be up to 10 MB.” As was stated above, in EbA this kind of requirement is viewed as a feature, which in this case can be formulated as follows: The customers of the e-service can upload one file with no format specified, but a size limit of 10 MB.",
      "text2": "The EbA tool allows you to group features by topic using the „Add new feature group“ function."
    },
    "step2": {
      "header": "Step 2. Decide which stakeholders are involved in the feature and what preconditions are expected from stakeholders within this specific feature",
      "text": "For each feature, decide which stakeholders are involved or significantly affected by the feature and what the essential knowledge and awareness, attitudes, skills, emotions, means, and activities expected from stakeholders within this specific feature to make this feature efficient (See Fig. 3). For example, what the stakeholder must do, know or be able to do as a precondition that the solution under development will work efficiently? Besides, think about preconditions that are not directly related to the product but will be significantly affected by the feature. When writing down the preconditions, consider emotional goals (how the stakeholder must feel), quality goals (what quality characteristics the product must have), and the general goals of the product (what the product is created for, for example, reducing bureaucracy or accelerating the process).<br></br>Use the brainstorming method. For the EbA method, formulate the feature's preconditions in a supportive way.",
      "example": "The preconditions for the feature in our running example could be as follows:<ol><li>recipients of the files use the same software package as the customers;</li><li>the customers are using common software packages;</li><li>recipients of the files do not need to process the information in the file;</li><li>the customers can compress files without losing the quality of images;</li><li>the customers know how to include all the information in one file;</li><li>the customers do not mind including all the information in one file.</li></ol>",
      "text2": "In the following steps, we will try to find out to what extent these preconditions are met. Using the EbA tool, you will be asked: Do + Stakeholder + Feature precondition.",
      "example2": "For example, in the EbA method tool, precondition No. 1 is formulated as the following question: “Do + recipients of the files + use the same software package as the customers?“"
  },
    "step3": {
      "header": "Step 3. Find an example of a situation that identifies with the precondition and that the stakeholder has experienced in the past",
      "text": "Activity, skill, attitude, presence of the means, use of devices, etc., indicated in the precondition, are expressed in some situations in some kind of behavior. For each precondition, find the closest situation that the stakeholder has experienced in the past where the same behavior of the stakeholder has appeared as described in the precondition (See Fig. 4). It is suitable to use the brainstorming method to obtain the examples.<br></br>For example, if it is crucial for the feature to be successful that the stakeholder follows the agreed process in detail, find an example of a situation where the same stakeholder has had to follow the same process in detail previously. It would be great if you could find an example where the context of previous experiences matches with the context of the precondition. If you cannot find such an example that applies to the entire stakeholder group, then try to find an example that some of the stakeholder representatives have experienced, e.g., only some of them have had to follow the process in detail. If you can't find one, bring an example experienced by another stakeholder for comparison, e.g., a different stakeholder who has been in a situation where they had to complete this process in detail. The experience of another stakeholder can also provide valuable information. The same recommendation applies to the context  – if you can't find an example that completely matches the context of the precondition, then give an example that is similar to the context, e.g., where the process is different, or there was no need to complete the process in detail, or the process used to take place on paper will now be digital. If it is difficult to find a similar context, try to find an example of another context, e.g., another process that the stakeholder has had to perform in the past, or for instance, if the feature and precondition are about a workplace situation, the example describes a non-workplace situation. A different context can provide valuable information as well (see step 6). You can describe multiple examples for one precondition. If you don't find any comparable examples, leave the field unfilled.",
      "text2": "",
      "example": "In the running example, each of the six preconditions should be assigned a comparable example situation which identifies with the situation of the precondition and which the stakeholder has experienced previously. For example, precondition 1 (<i>recipients of the files use the same software package as the customers</i>) is concerned with using software file formats, so that the example situation could be: “The recipients of the files have previously opened the attachments sent by the customers via e-mail“."
    },
    "step4": {
      "header": "Step 4. Validate the consistency of the example with the precondition and evaluate the stakeholder's performance in the example given for comparison",
      "text": "Steps 4.1 and 4.2 assess to what extent the feature precondition and example situation are comparable by stakeholder and context. Steps 4.3 and 4.4 evaluate whether the behavior of the stakeholder was purposeful and what the satisfaction level of the stakeholder was in the comparable situation. (see Fig. 5)<br></br>For step 4, the information can be obtained from various sources: published research results and statistics, research articles, opinions left on social media, previously collected user behavior and feedback from service providers, and information synthesized by the requirement engineer based on public information and work experience.",
      "subheading1": "Step 4.1. The same stakeholder?",
      "text1": "Validate, whether the stakeholder of the feature precondition is the same as the stakeholder in the comparable example situation. If the stakeholder is the same and all they have experienced the example situation, the answer is “Yes”. When about half or only some users of the stakeholder have experienced the example situation, the answer is “Partly”. If none of the users from the precondition have experienced the example situation, the answer is “No”. If it is known that there are stakeholders who have experienced the example situation, but we cannot identify them more precisely, the answer is “Don’t know”.",
      "subheading2": "Step 4.2. The same context?",
      "text2": "Validate, whether the context of the feature precondition is the same as the context in the comparable example situation.<br></br>The context of usage can be “a combination of users, goals, tasks, resources, and the technical, physical and social, cultural and organizational environments in which a system, product or service is used” (<i>ISO 9241-11: Ergonomics of Human System Interaction: Usability, Definitions, and Concepts. ISO 2018</i>) and also, for example, time and purpose, and whether the usage is by novice or experienced users.<br></br>If the context of the example completely overlaps with the context of the precondition, then the answer is “Yes”. If some important aspects of the context do not consistent, the answer is “Partially”. If the contexts are different, the answer is “No”. If you do not know the answer to the context overlap, select “Don't know”.",
      "subheading3": "Step 4.3. Purposeful usage?",
      "text3": "Please evaluate whether the stakeholder did act in the comparable example situation as expected and according to the purpose.<br></br>If the presence of a skill or knowledge is mentioned as a precondition, then evaluate to what extent this skill or knowledge met the expectations in the example situation, i.e., whether the stakeholder knew enough or whether the knowledge was apparent. If you expect that the stakeholder has some technical equipment or devices in use, evaluate the extent to which the stakeholder was using equipment or devices in the situation given as an example. If the precondition focuses on users' motivation, assess the stakeholder's motivation in the example situation. In the example situation, the same aspect that was focused on in the precondition must be assessed.<br></br>For example, if the precondition describes that the stakeholder follows the agreed process in detail, then the core element here is “following the process in detail” (see the description in Step 3). An example situation for comparison describes a situation where the same stakeholder is required to follow a different process at work but with a similar level of detail. In step 4.3 we should evaluate to what extent the stakeholder follows the process in detail. If the details are fully followed, the answer is “Yes”. If there is some deviation, the answer is “Partly”. If the details are not followed in the process, the answer is “No”. If at the moment you don’t known to what extent the stakeholder follows the process in detail, the answer is “Don't know”.",
      "subheading4": "Step 4.4. Satisfied with the solution?",
      "text4": "Evaluate the stakeholder's satisfaction when they had to act on purpose in the example situation. Satisfaction means (frequent) use without complaints. In the previous step (step 4.3), you evaluated whether the stakeholder did act in the comparable example situation as expected and according to the purpose. Now, mark the stakeholder satisfaction when acting in the example situation.<br></br>In the EbA method, what is to be evaluated under satisfaction? For example, if you look at the presence of skill or knowledge, you can assess whether complaints might be caused by the stakeholders' skill or knowledge not being up to the level expected. If the presence of equipment or devices was assumed, you can assess whether the reason for the dissatisfaction could have arisen from a lack of equipment or devices. If you evaluated the motivation, it is possible  – by going a little abstract  – to note whether the stakeholder's dissatisfaction is due to decreased interest and tiredness.<br></br>For example, in step 4.3, we evaluated the extent to which the stakeholders followed the process in detail. Now, we evaluate the stakeholder satisfaction by following the process in detail. If no complaints have been received regarding the requirement to follow the process in detail, the answer is  “Yes”. If you know there are some complaints, the answer to satisfaction is “Partly”. If a critical number of complaints have been received from the stakeholder, which in sum indicates a high level of dissatisfaction, the answer is  “No”. However, if there is no information about satisfaction, please mark “Don't know”.",
      "example": "In our example, we compare and evaluate feature prerequisite No. 1 (<i>recipients of the files use the same software package as the customers</i>) with the example presented for comparison (<i>the recipients of the files have previously opened the attachments sent by the customers via e-mail</i>) as follows:<br></br>4.1.) “Yes”, the stakeholder is the same one who previously opened files sent by e-mail.<br></br>4.2.) “Yes”, the context is the same, because the same kinds of files were created and sent by the customers.<br></br>4.3.) It was a “partly” purposeful usage because the recipients of the files claimed they used the Windows operating system, but they occasionally also received files from customers using the IoS operating system that would not open.<br></br>4.4.) The answer to the question about satisfaction of the recipients of the files is “no”, because the files that would not open caused them additional work."
    },
    "step5": {
      "header": "Step 5. Prioritize examples (if needed)",
      "text": "If there are multiple examples for one precondition and step 4.1–4.4 answers do not overlap, please prioritize what is the most relevant example for you. In the EbA tool, this option is displayed only when the need for prioritization appears. Selecting the most relevant example reduces the workload in the next step."
    },
    "step6": {
      "header": "Step 6. The EbA method provides an answer that describes the extent to which the precondition exists",
      "text": "At this step, the EbA method formulates a sentence indicating how much the stakeholder's acting corresponds to the expectations mentioned in the preconditions. Based on the answers given in step 4, you may not receive information about your stakeholder. Still, you may receive information about a different stakeholder. In the EbA method, information obtained about other stakeholders and different contexts is also valued since we can receive positive or warning examples from it. The “don't know” information is also essential in the EbA method because it helps realize what should be tested by testing with users.<br></br>Using the EbA method tool, the sentence describing the extent to which the precondition exists is combined automatically. The sentence is combined in the following way: The answers given in steps 4.1–4.4 provide the possibility of 256 combinations of answers. For each combination, the meaning is expressed as one part of the sentence that describes the extent to which the precondition is met. You can find all the 256 sentences under the label “Combined Answers”. If you do not use the EbA tool, find a combination of the 256 sentences that match the answer in 4.1–4.4. To this sentence the Stakeholder and the Feature precondition is added (See Fig. 6). The stakeholder and precondition are exact same as you entered previously in step 2.",
      "text2": "The combined sentence could be read as an answer to the question that appeared when we previously wrote down the feature's preconditions in the EbA method tool. The question is: Do + Stakeholder + Feature precondition? We get the answer by adding the following information together: Combination of answers (<i>see under label “Combined Answer</i>”) + Stakeholder + Feature precondition. By using the EbA method tool, the answer is displayed automatically.",
      "example": "Let us remind you that our feature precondition number 1 raised the question: Do recipients of the files use the same software package as the customers? After performing steps 1–4 with the input described above, EbA gives the following answer: “There is dissatisfaction with this precondition (<i>using the same software</i>), but to an extent, + recipients of the files + are using the same software as clients”. The example is illustrated by Figure 7."
    },
    "step7": {
      "header": "Step 7. Make a conclusions and create an action plan",
      "text": "After completing steps 1–4 and, if necessary, prioritizing the examples (step 5), read the displayed answers of the EbA method (step 6). The EbA method combined answers that  – based on the stakeholder's previous actions  – describe the extent to which the preconditions have been met. Based on the answers, decide whether the preconditions are met sufficiently for the solution to work successfully, or if not, decide what to do to improve the situation. Create an action plan (See Fig. 8).<br></br>If an example has been found for the precondition, whose target group and context (partially) overlap, and the intended use and satisfaction with the solution have received the answer “Yes” , “Partly”, or “No”, we could read this sentence as a prediction of user action in the product we are developing. You can decide whether the preconditions for the feature are sufficiently present for the product to function efficiently. If so, it gives confidence that there should not be any significant problems in this regard. If not, what should be changed? What should be done differently? If the analysis leads to you changing any characteristic in the product solution, perform the EbA analysis again on the updated aspect.<br></br>If the example provided as a comparison to the precondition applies to another stakeholder group or other context, we can also get important information from there. For example, if a different stakeholder has no problem meeting the precondition and is satisfied, then it would be helpful for us to know what has created such a good result in that context and if there is anything to learn. Conversely, if there are problems with goal achievement and/or satisfaction, this situation could be analyzed as a warning example. However, examples from other stakeholders or contexts do not allow us to draw conclusions about our stakeholders and context. For this, either additional analysis or testing with users must be planned.<br></br>A “Don't know” answer gives us a guideline to investigate the existence of a precondition further or mark it as something that needs to be tested by user testing.<br></br>Some special attention should be paid to situations where purposeful use has received the answer “Yes”, but satisfaction has the answer “No”. It provides information about a situation where a stakeholder acts as intended, but something needs to be developed differently in our system to prevent dissatisfaction. On the contrary, if the purposeful use has received the answer “No,” i.e., the action is not purposeful, but the satisfaction is positive, i.e., “,” then offering the same solution for the same stakeholder group, in the same way, will most likely mean extra work for someone.",
      "plan1": "The feature’s precondition is met, i.e ”it works”",
      "plan2": "Technology needs to be complemented",
      "plan3": "The solution does not work this way, a different solution has to be found",
      "plan4": "The feature needs a support action",
      "plan5": "The precondition needs to be tested or further analyzed",
      "plan6": "Something else",
      "example": "In our example, after analyzing all six preconditions, the analyst can decide what to do to improve the aspect of dissatisfaction. When offering a solution, it is essential to ensure that it does not conflict with the action plan of the rest of the preconditions of the feature and is consistent with the overall purpose of the product. Without knowing the results of the analysis of the remaining five preconditions of this feature, we can decide, at the moment, that to prevent dissatisfaction, the file formats should be limited, and customers should be shown which formats are allowed to upload."
    },
    "nb": {
      "header": "By using the EbA method, please keep in mind:",
      "text": "<ol><li>The EbA method helps to get answers to what is asked, according to what is entered as features and what is asked as preconditions, both in terms of content and scope.</li><li>The content of the analysis and the quality of the action plan relate to the expanded knowledge of the person making the analysis and the ability to identify related stakeholders, describe stakeholders' activities in the planned product, and the preconditions expected from the stakeholders.</li><li>he validity of the information obtained from the analysis depends on the situation of the example (stage 3) given for comparison to the precondition and its adequate evaluation (stage 4).</li></ol>"
    },
    "figures": {
      "1": "assets/Figures/Figure1.png",
      "2": "assets/Figures/Figure2.png",
      "3": "assets/Figures/Figure3.png",
      "4": "assets/Figures/Figure4.png",
      "5": "assets/Figures/Figure5.png",
      "6": "assets/Figures/Figure6.png",
      "7": "assets/Figures/Figure7.png",
      "8": "assets/Figures/Figure8.png"
    },
    "figureText": {
      "1": "Figure 1. The EbA framework",
      "2": "Figure 2. The description of the planned solution is divided into features",
      "3": "Figure 3. For each feature it is decided who are the stakeholders involved in the feature and what are the preconditions",
      "4": "Figure 4. For each precondition, the closest comparable example situation that the stakeholder has experienced in the past should be found",
      "5": "Figure 5. Validating the accuracy of the example and assumption, and the behavior of stakeholders in the example situation",
      "6": "Figure 6. EbA yields a combined answer as a part of the sentence that describes the precondition situation and combines this with the Stakeholder and Feature precondition",
      "7": "Figure 7. An example analyzed by the EbA framework",
      "8": "Figure 8. Based on predictions make an action plan"
    }
  },
  "questionnaires": "Questionnaires",
  "et": "EST",
  "en": "ENG"
}
