{
  "button": {
    "delete": "Kustuta",
    "edit": "Muuda",
    "add": "Lisa",
    "cancel": "Loobu"
  },
  "menu": {
    "edit": "Muuda",
    "delete":"Kustuta",
    "copy": "Tee koopia",
    "download": "Lae alla",
    "addStakeholder": "Lisa sidusrühm",
    "addPrecondition": "Lisa eeltingimus",
    "deletePrecondition": "Kustuta eeltingimus",
    "deleteFeature": "Kustuta tunnus",
    "addExample": "Lisa situatsioon",
    "deleteExample": "Kustuta situatsioon",
    "noExample": "Näidet pole"
  },
  "toolbar": {
    "name": "EUIM",
    "projects": "Projektid",
    "method": "KPA meetod",
    "about": "Meist"
  },
  "languages": {
    "est": "EST",
    "eng": "ENG"
  },
  "addProject": {
    "title": "Lisa projekt",
    "input": "Projekti nimi",
    "placeholder": "Sisesta nimi"
  },
  "projectsTable": {
    "title": "Projektid",
    "seeMore" : "Vaata ->"
  },
  "deleteProjectModal": {
    "title": "Kustuta projekt: {{name}}",
    "body": "Kas oled kindel, et soovid projekti kustutada?"
  },
  "deleteFeatureGroupModal": {
    "title": "Kustuta grupp",
    "body": "Kas oled kindel, et soovid gruppi kustutada?"
  },
  "deleteStakeholderModal": {
    "title": "Kustuta sidusrühm",
    "body": "Kas oled kindel, et soovid sidusrühma kustutada?"
  },
  "editProjectModal": {
    "title": "Muuda projekti nime: {{name}}",
    "input": "Projekti nimi"
  },
  "editFeatureGroupModal": {
    "title": "Muuda grupi nimetust",
    "input": "Funktsionaalsuste grupi nimetus"
  },
  "editStakeholderModal": {
    "title": "Muuda sidusrühma nimetust",
    "input": "Sidusrühma nimetus"
  },
  "addGroup": {
    "title": "Lisa funktsionaalsuste grupp",
    "list": "Olemasolevad funktsionaalsuste grupid",
    "input": "Funktsionaalsuste grupi nimetus",
    "placeholder": "Sisesta tunnuse ID või lühend"
  },
  "addStakeholder": {
    "title": "Lisa uus sidusrühm",
    "list": "Olemasolevad sidusrühmad",
    "input": "Sidusrühma nimetus",
    "placeholder": "Sisesta nimetus mitmuses"
  },
  "table": {
    "newRow": "Lisa uus rida",
    "deleteRow": "Ridade kustutamine",
    "delete": "Kustuta",
    "edit": "Muuda",
    "save": "Salvesta",
    "cancelEdit": "Tühista muutmine"
  },
  "select": {
    "chooseOption": "Vali",
    "yes": "Jah",
    "no": "Ei",
    "dontKnow": "Ei tea",
    "partly": "Osaliselt"
  },
  "methodCombinations": {
    "YES": "Jah",
    "NO": "Ei",
    "DONT_KNOW": "Ei tea",
    "PARTLY": "Osaliselt"
  },
  "plan": {
    "text": "Vali värv",
    "green": "Toimib",
    "red": "Ei toimi",
    "blue": "Testimisele",
    "yellow": "Lisategevus",
    "pink": "Täiendamisele",
    "none": "Muu"
  },
  "about": {
    "header": "Meist",
    "section1Heading": "EbA meetod",
    "section1Text": "Kogemuse-põhine analüüs ehk Experience-based Analysis (EbA) kui meetod on loodud eesmärgiga muuta digitoodete ja e-teenuste arendus kuluefektiivsemaks, kuna EbA meetod aitab tootearenduse varases faasis saada aimu, kas lahendus kavandatud moel hakkab toimima ja millised on võimalikud riskid – seda just lähtuvalt kasutajate käitumise ja harjumuste seisukohast. EbA meetodi autor on Anu Piirisild, kes kirjeldas meetodit esmalt 2021 a. oma magistritöös, kuid jätkab meetodi uurimist ja täiustamist Tartu Ülikooli doktorantuuris. Meetod on hetkel testimisfaasis. Meil oleks hea meel, kui jagaksite meiega oma kogemust nii EbA meetodi ja kui ka selle töövahendi kohta. Tagasisidet ootame e-mailile ",
    "section2Heading": "EbA meetodi töövahend EBA-UIM tool",
    "section2Text": "<b>EBA-UIM Tool</b> ehk EbA meetodi töövahend lihtsustab EbA meetodi kasutamist. Töövahend aitab infot struktureerida ning kuvab analüüsitava toote/e-teenuse kasutatavust prognoosivad kirjeldused automaatselt.<br></br>Töövahendis saate luua projekte, teha nendest koopiaid ja neid Excel-formaadis alla laadida. Allalaaditud Excel-failis saate analüüsitud infot oma vajaduste järgi visuaalselt kohandada. Töövahend sisaldab ka näidisprojekti, EbA meetodi kirjeldust ja meetodi kasutamise juhendit. Hetkel on töövahend kahes keeles: eesti ja inglise keeles.<br></br><b>EBA-UIM</b> tool on võrguühenduseta rakendus, mis salvestab analüüsi andmed kasutaja enda arvutisse. Rakendus on majutatud Tartu Ülikooli Teadusarvutuste keskuses. Rakendus on tasuta kasutamiseks. EbA meetodi ja töövahendi ÕIGUSED KUULUVAD….<br></br>Töövahendit on kavas täiendada, mistõttu soovitame käia aeg-ajalt vaatamas uuendatud versiooni. Info uuendatud versiooni ja selle allalaadimise kohta leiate TÜ teadusarvutuste keskuse lehelt:..... ",
    "section3Heading": "Töövahendi EBA-UIM tool meeskond",
    "section3Text": "<b>EBA-UIM tool</b> rakendus on edasiarendus EbA meetodi töövahendi MVP (<i>minimum viable product</i>) versioonist. <b>EBA-UIM tool</b> rakenduse on arendanud Tartu Ülikooli …. eriala tudengid Iris Kreinin ja Karl Olaf Kuldmaa oma bakalaureuse lõputöö raames. Iris Kreinin lõi rakenduse ………………………... Karl Olaf Kuldmaa …………………………. Anu Piirisild koostas EbA meetodi kasutusjuhendi ja meetodit selgitavad tekstid ning näidisprojekti.",
    "contact": "Kontakt",
    "address": "Tartu Ülikool<br></br>Arvutiteaduse instituut<br></br>Narva mnt 18<br></br>51009 Tartu, Eesti"
  },
  "combinations": {
    "header": "Kombineeritud vastused",
    "section1Heading": "Kombinatsioonide variandid",
    "section1Text": "Tabelis leiate kõik kombinatsioonid, mis võivad tekkida nelja küsimuse ja nelja vastusevariandi korral. Kombinatsioone on kokku 256. Igale kombinatsioonile on antud interpetatsioon, mis moodustab lause osa, millele tuleb liita sidusrühma nimetus koos funktsionaalsuse eeltingimusega (vt sildi alt “EbA meetod“). Selliselt kokku liidetuna annab EbA meetod lause, mis indikeerib, kuivõrd vastab sidusrühma tegutsemine neile ootustele, mida nimetati eeltingimuses.<br></br>256 kombinatsioonile on juurde lisatud üks kirjeldus juhuks, kui varasemalt kogetud näidet pole võrdluseks leitud. <br></br>Kombinatsioonid on interpreteerinud EbA meetodi looja Anu Piirisild.<br></br>Kombinatsioonide variandid ja nende sõnastus:",
    "section2Heading": "Kombinatsioonide tõlgendamine",
    "section2SubHeading": "2.1. Kuidas lugeda kombinatsioonide vastuseid EbA meetodi töövahendis",
    "section2Text": "Tulemusi võib lugeda mitmel erineval viisil, vastavalt milline endale omasem tundub:<br></br><ol><li>Vaadata kolmik-tulpa “Kirjeldus, mil määral on eeltingimus täidetud”, kus lause iga osa on eraldi tulbas välja toodud: vastuste kombinatsiooni interpretatsioon + sidusrühm + funktsionaalsuse eeltingimus. Selline lause kuva sobib neile, kes soovivad tulemust lugeda tervikliku lausena, kuid samas hoida iga lause osa eraldatud vaates.</li><li>Vaadata 3-osalist lauset kokku kirjutatuna. Lause asub töövahendis kolmik-tulba “Kirjeldus, mil määral on eeltingimus täidetud” järel. Selline lause kuva on mõeldud neile, kes soovivad tulemust lugeda täislausena, ilma lause osi eraldamata. Seda tulpa on soovituslik kasutada ka juhul, kui analüüsi tulemused lisatakse dokumentatsiooni ja on soov lühidalt juurde näidata, mis oli tegevuskava otsuste sisendiks, st mis tulemuse EbA analüüs andis. EbA töövahendis saab kokku kirjutatud lause tulba ära peita.</li><li>Vaadata neljale küsimusele antud jah-osaliselt-ei-ei tea vastuseid iseseisvalt ilma lauseks formuleeritud sõnastuseta, ja selle juurde kuuluvat sidusrühma koos funktsionaalsuse eeltingimusega ning anda omaenda tõlgendus olukorrale.</li></ol>",
    "section2SubHeading2": "2.2. Kombinatsioonidele sõnastuse loomise printsiibid",
    "section2Text2": "Kombinatsioonide interpreteerimisel on vastuste sõnastustes järgitud, et i) lause sisaldaks olukorra olulisemaid aspekte ja tulemus annaks edasi sisulist infot; ii) lause süntaks võimaldaks sellega siduda eelnevalt sisestatud sidusrühma ja funktsionaalsuse eeltingimuse ilma viimaste sõnastust muutmata; iii) lauset saaks kasutada eri tüüpi eelduste kohta; iiii) lauses saaks kasutada korduvaid elemente.<br></br>Vastused on mõeldud katma eri tüüpi eelduseid universaalselt, nt teadmisi, teadlikkust, hoiakuid, oskuseid, emotsioone, vahendite olemasolu või tegevusi. Seetõttu tuleks interpreteeritud lauseid lugeda mõningase abstraktsiooniga.<br></br>Järgnevalt kirjeldatakse interpretatsiooni printsiipe ja lausetes korduvaid elemente.",
    "selection1Heading": "2.2.1. Sama sidusrühm? – vastuste interpreteerimine lauses",
    "selection1Yes": "Vastuse “Jah” puhul lauses sidusrühma eraldi ei rõhutata, sest lausest saab välja lugeda, et info kehtib kogu sidusrühma kohta.",
    "selection1Partly": "Vastus “Osaliselt” tähendab, et EbA meetodis võrdluseks toodud varasema kogemuse situatsiooni näide kehtib osade sidusrühma esindajate kohta. Seetõttu saame järeldusi teha vaid osade sidusrühma esindajate kohta. Lauses kasutatakse sel juhul sõna “osad”. Siiski, erand tuleb sisse juhul, kui kombinatsioonis on eesmärgipärase kasutuse vastuseks “Ei” või “Ei tea”. Sellises olukorras üldistab vastulause olukorra kogu sidusrühma peale, sest isegi kui see väiksem hulk kogu sidusrühmast ei tegutsenud eesmärgipäraselt (vastus “Ei”) või tegutsemise tulemus polnud teada (vastus “Ei tea”), pole meil alust eeldada, et loodavas tootes on tegutsemine eesmärgipärane.",
    "selection1No": "Kui vastus on “Ei”, annab olukorda kirjeldav lause teada, et “on üks teine sidusrühm”, kelle kohta meil on infot, mis võiks lugejat suunata vaatama teise sidusrühma tegutsemist, et võtta sealt eeskuju. Lause tuletab seejuures meelde, et siiski, toote tegeliku sidusrühma kohta pole teada, kas eeltingimus on täidetud.",
    "selection1DontKnow": "Kui vastus on “Ei tea”, annab olukorda kirjeldav lause teada, et “on mingi sidusrühm”, kelle kohta meil on infot, kuigi seda sidusrühma ei osata hetkel defineerida. Vastus võiks lugejat suunata vajadusel sidusrühma täpsemalt defineerima, et võtta sealt eeskuju. Lause tuletab seejuures meelde, et siiski, toote tegeliku sidusrühma kohta pole teada, kas eeltingimus on täidetud.",
    "selection2Heading": "2.2.2. Sama kontekst? – vastuste interpreteerimine lauses",
    "selection2Yes": "Vastuse “Jah” puhul lauses konteksti samasust eraldi ei rõhutata, sest kolmest osast kombineeritud olukorda kirjeldav vastuslause annab oma sõnastusega aimu, et kontekstis erisusi pole.",
    "selection2Partly": "Vastus “Osaliselt” annab teada, et info kehtib “veidi teise” konteksti koha.",
    "selection2No": "Kui vastus on “Ei”, kasutatakse olukorda kirjeldavas lauses väljendit “ühes teises kontekstis”, mis võiks lugejat suunata vaatama neid teisi kontekste, et võtta sealt head või hoiatavat eeskuju.",
    "selection2DontKnow": "Kui vastus on “Ei tea”, kasutatakse olukorda kirjeldavas lauses väljendit “mingisuguses teadmata kontekstis”, mis võiks lugejat suunata vajadusel konteksti täpsemalt välja selgitama, et võtta sealt head või hoiatavat eeskuju.",
    "selection3Heading": "2.2.3. Eesmärgipärane kasutus? – vastuste interpreteerimine lauses",
    "selection3Yes": "Kui eesmärgipärase kasutuse kohta on vastus “Jah”, pole lauses tegutsemise eesmärgipärasust eraldi rõhutatud juhul, kui sidusrühm on sama (vastus “Jah”) või osaliselt sama (vastus “Osaliselt”). Lause sõnastus annab sel juhul ise aimu, et eesmärgipärane tegutsemine on olemas. Kui sidusrühma samasuse vastus on “Ei” või “Ei tea”, siis on ka eesmärgipärane kasutus lauses välja toodud.",
    "selection3Partly": "Vastust “Osaliselt” väljendatakse lauses sõnastusega “mõningal määral”, mis tähendab, et tegutsemise ulatus, kvaliteet või tegevus vastab ootustele vaid osaliselt.",
    "selection3No": "Kui vastus on “Ei”, kasutab olukorda kirjeldav lause väljendit “tegutsemise tulemus on ebakorrektne”. “Ei” vastuse korral sisaldab lause ka meeldetuletust, et praeguse info põhjal pole alust eeldada, et loodavas tootes oleks tegutsemine eesmärgipärane. See omakorda tähendab, et sidusrühma tegutsemise eesmärgipärasust tuleb kas edasi analüüsida või saata testimisele.",
    "selection3DontKnow": "Vastus “Ei tea” antakse lauses edasi sõnastusega “tegutsemise tulemus ei ole teada”. Kui tegutsemise tulemus pole teada, tuletatakse olukorra kirjelduses meelde, et praeguse info põhjal pole alust eeldada, et loodavas tootes oleks tegutsemine eesmärgipärane. See omakorda tähendab, et sidusrühma tegutsemise eesmärgipärasust tuleb kas edasi analüüsida või saata kasutajatega testimisele.",
    "selection4Heading": "2.2.4. Lahendusega rahul? – vastuste interpreteerimine lauses",
    "selection4Yes": "Kui vastus on jah, siis lauses rahulolu olemasolu eraldi välja ei tooda. Lause sõnastus annab aimu, et eeltingimusega rahulolu on olemas.",
    "selection4Partly": "Kui vastus on “Osaliselt”, siis lauses väljendatakse seda sõnastusega “esineb rahulolematust selle eeltingimusega”.",
    "selection4No": "Kui vastus on “Ei”, sisaldab olukorda kirjeldav lause väljendit “eeltingimusega ei olda rahul”. Selline info võiks suunata lugejat leidma teistsugust lahendust, millega rahulolu tõenäosus oleks suurem.",
    "selection4DontKnow": "Vastus “Ei tea” väljendub lauses sõnastusega “rahulolu selle eeltingimusega pole teada”. Selline teave võiks suunata lugejat rahulolu välja selgitama kas edasise analüüsi või kasutajatega testimisega."
  },
  "method": {
    "general": {
      "example": "Näide"
    },
    "intro": {
      "title": "EbA meetod",
      "header": "Kogemuse-põhine analüüsi (EbA) meetod / Experience-based Analysis (EbA) Method",
      "text": "Kogemuse-põhine analüüs (EbA) meetodina on loodud eesmärgiga saada digitoodete või e-teenuse (edaspidi: toode) arendamise võimalikult varases faasis aimu, kas lahendus kavandatud moel hakkab toimima ja millised on võimalikud riskid – seda just lähtuvalt kasutajate käitumise ja harjumuste seisukohast. Kui nõuete valideerimise käigus keskendutakse tavaliselt sellele, et teada saada, kas arendatav toode vastab sidusrühmade vajadusele, siis EbA eesmärk on teada saada, kuivõrd on sidusrühmadel olemas vajalikud teadmised, oskused, harjumused või vahendid, mis on toote edukuseks vajalikud. EbA meetod toetub põhimõttele, et inimestel on käitumismuster, mis tugineb varasematele harjumustele.<br></br>EbA meetodit saab rakendada kasutatavuse inspekteerimiseks kohe, kui uus lahendus on ära kirjeldatud. EbA meetodit kasutades on võimalik juba lahenduse visiooni valideerides saada aimu, kas sellisena hakkab toode toimima või on mõistlik nõudeid pigem muuta, või vajavad mingid aspektid täiendavat analüüsi. Varakult analüüsides saadakse ülevaade olukorrast juba enne, kui nõuete põhjal hakatakse prototüüpi tegema, testimisi läbi viima ja arendama. EbA meetodis sobivad analüüsimiseks lahenduse kirjeldused, mis näitavad, mida kasutajad saavad või peavad tegema, kasutuslood, kasutusjuhud, stsenaariumid, protsessi kirjeldused, kavandatava lahenduse üldisemad kirjeldused ärianalüüsi või strateegia dokumendist, andmed teekonna kaardilt, eesmärgimudeli funktsionaalsed nõuded vms sisendid, mis kirjeldavad kavandatavat lahendust ja kus on näha sidusrühmade kaasatust.<br></br>EbA meetod on mõeldud eelkõige kasutamiseks neile, kes tegelevad toote nõuete väljaselgitamisega. Lisaks nõuete analüüsi tegijatele on EbA meetod mõeldud kasutamiseks ka tooteomanikele, ärianalüütikutele jms.<br></br>Joonisel 1 on kujutatud EbA meetodi raamistik, mis kajastab EbA analüüsiks vajaminevaid komponente ja analüüsi protsessi. Esmalt tuleb kavandatud lahenduse kirjeldus jagada funktsionaalsusteks (ingl features). Seejärel peab otsustama, millised sidusrühmad (ingl stakeholders) on funktsionaalsusega seotud ja millised on funktsionaalsuse edukaks toimimiseks vajalikud eeltingimused. Igale eeltingimusele tuleb leida näide situatsioonist, mis samastub eeltingimusega ja mida sidusrühm on varasemalt kogenud. Järgnevalt tuleb määrata, mil määral on funktsionaalsuse eeltingimus ja näite situatsioon võrreldavad lähtuvalt sidusrühmast ja kontekstist ning hinnata, kas sidusrühma käitumine võrreldavas näites oli eesmärgipärane ja milline oli seejuures sidusrühma rahulolu. EbA meetod kombineerib vastuse, mis  – tuginedes sidusrühma varasemale tegutsemisele  – kirjeldab, mil määral on eeltingimus täidetud uue toote kontekstis. Need vastused aitavad otsustada, kas eeldused on lahenduse edukaks toimimiseks piisavad või mitte ja on abiks edasiste tegevuste kavandamisel."
    },
    "step1": {
      "header": "Etapp 1. Jaga kavandatud lahenduse kirjeldus funktsionaalsusteks (feature)",
      "text": "Jagage digitoote/e-teenuse (edaspidi: toode) lahenduse kirjeldus funktsionaalsusteks (ingl feature) ja tõstke iga funktsionaalsus eraldi reale (vt joonis 2). Iga funktsionaalsus kirjeldab ühte või mitut loogilises seoses olevat lahendust, mis pakuvad sidusrühmale väärtust ja toetavad toote loomise eesmärki. Lisaks interaktsioonide ja toote enda kirjeldamisele sõnastage funktsionaalsuste alla aspekte, mis defineerivad toodet üldisemalt. Näiteks, kirjeldage toote laiemat konteksti ja selle sõltuvusi teiste teenuste ja protsessidega, mida arendatav toode mõjutab, või mis mõjutavad teie toodet. Kui paistab, et toote põhiprintsiibiga on seotud kasutajate või huvigruppide tegevusi, lisage funktsionaalsuste loetelusse ka toote aluspõhimõtete kirjeldusi.",
      "example": "Oletame, et üks e-teenuse platvorm vajab täiendamist. Kui seni pidid kliendid täiendava info saatma e-mailile, siis uues lahenduses saavad kliendid kohe teenuse enda juures ka failid üles laadida. E-teenuse omanik arvab arendusvajaduse kohta esialgu järgmist: “Ärme hakka faili formaate limiteerima. Nagunii kasutavad kliendid üldkasutatavaid tarkvara formaate. Küll aga võiksime limiteerida failide arvu. Üles võib laadida faid ühe faili ja selle suurus on kuni 10 MB.” Nagu eelpool öeldud, EbA meetodis me vaatame sellist nõuet funktsionaalsusena. Sõnastame funktsionaalsuse järgmiselt: E-teenuse kliendid saavad üles laadida ühe faili mahuga kuni 10 MB, faili formaati ei piirata.",
      "text2": "EbA töövahend võimaldab funktsionaalsuseid teemade kaupa grupeerida funktsiooniga „Lisa uus funktsionaalsuse grupp“."
    },
    "step2": {
      "header": "Etapp 2. Otsusta, millised sidusrühmad on funktsionaalsusega seotud ja millised on funktsionaalsuse edukaks toimimiseks vajalikud eeltingimused",
      "text": "Vaadake iga funktsionaalsust ja otsustage, millised sidusrühmad (ingl stakeholders) on funktsionaalsusega seotud või funktsionaalsusest mõjutatud. Analüüsige selle funktsionaalsuse ulatuses, milliseid olulisemaid teadmisi või teadlikkust, hoiakuid, oskuseid, emotsioone, vahendeid ja tegevusi te eeldate oma sidusrühmadelt, et see funktsionaalsus toimiks tõhusalt (vt joonis 3). Näiteks mida peavad sidusrühma kuulujad tegema, teadma või olema võimelised tegema eeltingimusena, et toote kavandatav lahendus looks seda väärtust milleks ta on loodud? Kaardistage ka need eeldused, mis pole otseselt arendatava tootega seotud, kuid on funktsionaalsusest siiski märkimisväärselt mõjutatud. Eeltingimusi kirjeldades arvestage ka emotsionaalsete eesmärkidega (kuidas sidusrühm peab end tundma), kvaliteedi eesmärkidega (milliste kvaliteedinäitajatega peab toode olema) ja toote üldeesmärkidega (millist eesmärki peab toode täitma, näiteks bürokraatia vähendamine või protsessi kiirendamine).<br></br>Info kaardistamiseks kasutage ajurünnakut. EbA meetodi jaoks sõnastage funktsionaalsuse eeltingimused eesmärki toetaval viisil.",
      "example": "Eelpool alustatud näite funktsionaalsuseks märkisime “E-teenuse kliendid saavad üles laadida ühe faili mahuga kuni 10 MB, faili formaati ei piirata.”<br></br>Sidusrühmad ja eeltingimused sellele tingimusele võiksid olla järgmised:<ol><li>failide vastuvõtjad kasutavad samu tarkvaraprogramme kui kliendid; </li><li>kliendid kasutavad üldlevinud tarkvaraprogramme;</li><li>failide vastuvõtjad ei pea failide sees olevat infot töötlema;</li><li>kliendid oskavad failide mahtu vähendada ilma et piltide kvaliteet langeks;</li><li>kliendid oskavad koondada infot ühe faili sisse;</li><li>kliendid ei pane pahaks, et peavad info koondama ühte faili.</li></ol>",
      "text2": "Järgnevalt püüamegi välja selgitada, kuivõrd need esitatud eeltingimused peavad paika. Kasutades EbA töövahendit kuvatakse teile eeltingimus küsimusena: Kas + Sidusrühm + Funktsionaalsuse eeltingimus.",
      "example2": "Näite eeldus nr 1 formuleerub EbA meetodi töövahendis küsimuseks „Kas <i>failide vastuvõtjad</i> kasutavad samu tarkvaraprogramme kui kliendid?“"
    },
    "step3": {
      "header": "Etapp 3. Leia näide situatsioonist, mis samastub eeltingimusega ja mida sidusrühm on varasemalt kogenud",
      "text": "Eeltingimuses silmas peetud tegevus, oskus, suhtumine, vahendite olemasolu, seadmete kasutamine jms väljenduvad mingis situatsioonis ja mingisuguses käitumises. Leidke igale eeltingimusele võimalikult sarnane situatsioon, mida sidusrühm on varem kogenud ja kus ilmneb sidusrühma samasugune toiming, nagu on kirjeldatud eeltingimuses (vt joonis 4). Näidete kaardistamiseks sobib kasutada ajurünnaku meetodit.",
      "text2": "Näiteks kui leiate, et funktsionaalsuse edukuseks on oluline, et sidusrühm järgib kokkulepitud protsessi detaili täpsusega, siis leidke näide olukorrast, kus sama sidusrühm on sama protsessi pidanud varasemalt täitma detaili täpsusega. Oleks hea, kui leiaksite sellise näite, milles varasema kogemuse kontekst langeb kokku eeltingimuses mõeldud kontekstiga. Kui sellist näidet ei leia, mis kehtiks kogu sidusrühma kohta, püüdke leida näide, mida osad sihtgrupi esindajad on kogenud, nt vaid osad sellest sidusrühmast on pidanud kõnealust protsessi järgima detaili täpsusega. Kui ka sellist ei leia, siis tooge siia võrdluseks mõne teise sihtgrupi kogetud näide, nt üks teine sihtgrupp on olnud olukorras, kus nad on seda protsessi pidanud täitma detaili täpsusega. Ka teiste sihtgruppide kogemused võivad anda väärtuslikku infot. Sama soovitus kehtib konteksti kohta  – kui ei leia näidet, mis kattuks täielikult eeltingimuse kontekstiga, siis tooge näide, mis on kontekstiga sarnane: nt on protsess veidi teine, või pole sidusrühm pidanud protsessi täitma detaili täpsusega, või hoopiski toimus protsess varasemalt paberil, kuid uue lahendusega muudetakse see protsess digitaalseks. Kui ka sarnase konteksti leidmine on keeruline, püüdke leida näide mõne teise konteksti kohta, nt mõne muu protsessi kohta, mida sidusrühm on varasemalt pidanud täitma, või näiteks kui funktsionaalsus ja eeltingimus käivad töö keskkonna kohta, siis võrdluseks toodud näide võib kirjeldada töövälist olukorda. Ka teistsugune kontekst võib pakkuda väärtuslikku infot (vt etapp 6). Ühele eeltingimusele võid kirjeldada mitu näidet. Kui ühtegi võrreldavat näidet ei leia, jätke väli tühjaks.",
      "example": "Käimasolevas näites tuleb igale eeltingimusele leida võrreldavaks näiteks mingi situatsioon, mis samastub eeltingimuse olukorraga ja mida sidusrühm on varasemalt kogenud. Näiteks eeltingimus nr 1 (failide vastuvõtjad kasutavad samu tarkvaraprogramme kui kliendid) on mõeldud tarkvara failiformaatide kasutamist. Seega, situatsiooni näide võiks olla järgmine: failide vastuvõtjad on eelnevalt avanud faile, mida kliendid on saatnud e-maili manusena."
    },
    "step4": {
      "header": "Etapp 4. Määra näite ühtivus eeldusega ja hinda sidusrühma tegevust võrdluseks toodud näites",
      "text": "Järgnevad etapid 4.1 ja 4.2. hindavad, mil määral on funktsionaalsuse eeltingimus ja näite situatsioon võrreldavad lähtuvalt sidusrühmast ja kontekstist. Etapid 4.3 ja 4.4 hindavad, kas sidusrühma käitumine võrreldavas näites oli eesmärgipärane ning milline oli seejuures sidusrühma rahulolu. (vt joonis 5)<br></br>Selle etapi täitmiseks leiab infot erinevatest allikatest: avaldatud uuringud ja statistika, teadusartiklid, sotsiaalmeedias kajastuvad arvamused, teenuse osutaja poolt varasemalt kogutud kasutaja käitumise ja tagasiside teave, nõuete analüüsi läbiviija enda teadmised, mis on ajapikku kogunenud nii avalikest allikatest kui ka töökogemuse käigus.",
      "subheading1": "Etapp 4.1. Sama sidusrühm?",
      "text1": "Hinnake, kas eelduses nimetatud sidusrühm on sama, keda olete silmas pidanud näites kirjeldatud situatsioonis.<br></br>Kui sidusrühm on sama ja kõik selle sidusrühma liikmed on kogenud näites nimetatud situatsiooni, siis on vastus “Jah”. Kui ainult pooled või osad sidusrühma kuuluvatest kasutajatest on kogenud näites kirjeldatud situatsiooni, on vastus “Osaliselt”. Kui eeltingimuse juures nimetatud sidusrühm ei ole kogenud näidissituatsiooni, on vastus “Ei”. Kui teil on teada, et on olemas mingi sidusrühm, kes seda näitesituatsiooni on kogenud, kuid te ei oska neid täpsemalt identifitseerida, valige vastuseks “Ei tea”. ",
      "subheading2": "Etapp 4.2. Sama kontekst?",
      "text2": "Hinnake, kas eelduses nimetatud kontekst on sama, mida on peetud silmas näitena kirjeldatud situatsioonis. Kasutuskontekst on näiteks “kasutajate, eesmärkide, ülesannete, ressursside ning tehnilise, füüsilise ja sotsiaalse, kultuurilise ning organisatsioonilise keskkonna kombinatsioon, milles süsteemi, toodet või teenust kasutatakse” (ISO 9241-11: Ergonomics of Human System Interaction: Usability, Definitions, and Concepts. ISO 2018), aga ka näiteks aeg ja kasutuseesmärk, ja kas kasutajateks on algajad või kogenud kasutajad.<br></br>Kui näites toodud kontekst kattub täielikult eeltingimuse kontekstiga, siis on vastus “Jah”. Kui mõni oluline aspekt kontekstis ei kattu, on vastus “Osaliselt”. Kui kontekstid on erinevad, on vastus “Ei”. Kui te ei oska hinnata konteksti kattuvust, valige vastuseks “Ei tea”.",
      "subheading3": "Etapp 4.3. Eesmärgipärane kasutus?",
      "text3": "Hinnake, kas näitena toodud situatsioonis on sidusrühm tegutsenud ettenähtud ja oodatud viisil.<br></br>Kui eeltingimusena on nimetatud mingi oskuse või teadmise olemasolu, siis hinnake, mil määral see oskus või teadmine näitesituatsioonis vastas oodatule, st kas sidusrühm oskas piisavalt või kas teadmine oli olemas. Kui eeldasite mingi tehnika, seadmete vms ressursside olemasolu, siis hinnake, kuivõrd olid need sidusrühmal kasutuses näitena toodud situatsioonis. Kui eeltingimuses on fookus motiveeritusel, siis hinnake, kuivõrd motiveeritud olid sidusrühma kasutajad näite olukorras. Situatsiooni näites tuleb hinnata sama aspekti, millele on keskenduti eeltingimuses.<br></br>Näiteks, kui eeltingimuseks on, et sidusrühm järgib kokkulepitud protsessi detaili täpsusega, siis selles eelduses on fookus seatud “protsessi järgmisele detaili täpsusega” (vt etapp 3 selgitust). Võrdluseks toodud situatsiooni näide kirjeldab olukorda, kus sama sidusrühm on kohustatud tööl ühte teistsugust protsessi järgima, kuid samalaadse detaili täpsusega. Etapis 4.3 hindame, kuivõrd see sidusrühm peab näites toodud protsessis kinni detailitäpsusest. Kui peetakse täielikult detailidest kinni, on vastus “Jah”. Kui toimub mingil määral kõrvalekaldeid, on vastus “Osaliselt”. Kui protsessis ei peeta detailidest kinni, on vastus “Ei”. Kui hetkel pole teada, kuivõrd peab sidusrühm kokkulepitud protsessis detailidest kinni, siis vastake “Ei tea”.      ",
      "subheading4": "Etapp 4.4. Lahendusega rahul?",
      "text4": "Hinnake, milline oli sidusrühma rahulolu, kui nad pidid näitena toodud situatsioonis tegutsema eesmärgipäraselt. Rahulolu tähendab (sagedast) kasutamist ilma kaebusteta. Eelmises etapis (etapp 4.3) hindasite, kas näitena toodud situatsioonis on sidusrühm tegutsenud ettenähtud ja oodatud viisil. Nüüd märkige, milline oli näitesituatsioonis tegutsedes sidusrühma rahulolu.<br></br>Mida EbA meetodis rahulolu all hinnata? Näiteks, kui vaatasite oskuse või teadmise olemasolu, siis saate hinnata, kas kaebused võivad olla tingitud sellest, et sidusrühma oskused või teadmised polnud eeldatud tasemel. Kui eeldasite tehnika või seadmete olemasolu, saate hinnata, kas rahulolematuse põhjus võis olla tekkinud tehnika või seadmete puudulikkusest. Kui hindasite eelmises etapis motiveeritust, siis on võimalik  – veidi abstraktsemaks minnes  – märkida, kas sidusrühma rahulolematus on tingitud huvi langusest ja väsimusest.<br></br>Näiteks, etapis 4.3 hindasime situatsiooni näites, kuivõrd detailitäpne on sidusrühm protsessi täites. Nüüd hindame sidusrühma rahulolu, kui nad on pidanud järgima protsessi detaili täpsusega. Kui pole laekunud kaebuseid, mis puudutavad protsessi detailset järgimist, on vastus ”Jah”. Kui teil on teada, et on mõningaid kaebuseid, on rahulolu vastus “Osaliselt”. Kui sidusrühmalt on laekunud kriitiline arv kaebuseid, mis kokkuvõttes näitavad suurt rahulolematust, on vastus “Ei”. Kui aga rahulolu kohta teavet pole, märkige “Ei tea”.",
      "example": "Käesolevas näites võrdleme ja hindame funktsionaalsuse eeltingimust nr 1 (failide vastuvõtjad kasutavad samu tarkvaraprogramme kui kliendid) sellele võrdluseks toodud näitega (failide vastuvõtjad on eelnevalt avanud faile, mida kliendid on saatnud e-maili manusena) järgmiselt:<br></br>4.1.) “Jah”, sidusrühm on sama kes ka varasemalt avas neid faile, mida kliendid saatsid e-mailile.<br></br>4.2.) “Jah”, kontekst on sama, sest klientide tehtud ja saadetud failid on samad, mida on peetud silmas eeltingimuses.<br></br>4.3.) Eesmärgipärane kasutus sai vastuseks “osaliselt”, kuna failide vastuvõtjad kasutavad Windowsi operatsioonisüsteemi, kuid nad on aeg-ajalt saanud faile, mida kliendid on loonud IoS operatsioonisüsteemiga ja seetõttu pole saanud neid faile avada.<br></br>4.4.) Vastus lahendusega rahulolu kohta on “ei”, kuna need mitteavanevad failid tekitasid faili saajatele lisatööd."
    },
    "step5": {
      "header": "Etapp 5. Prioritiseeri näited (vajadusel)",
      "text": "Kui ühe eeltingimuse kohta olete toonud mitu näidet ja etappide 4.1-4.4 vastused nendele näidetele ei kattu, palun valige näidetest välja kõige asjakohasem. EbA töövahendis kuvatakse see valik nähtavale alles prioritiseerimise vajaduse tekkimisel. Kõige asjakohasema näite välja valimine vähendab töö mahtu järgmises etapis."
    },
    "step6": {
      "header": "Etapp 6. EbA meetod annab vastuse, mis kirjeldab eeltingimuse olemasolu määra uue toote kontekstis",
      "text": "Selles etapis formuleerib EbA meetod lause, mis indikeerib, kuivõrd vastab sidusrühma tegutsemine neile ootustele, mida nimetati eeltingimustes. Olenevalt etapis 4 antud vastustest võib selguda, et mõnel juhul te ei saa infot enda sidusrühma kohta, kuid saate infot mõne teise sidusrühma kohta. EbA meetodis väärtustatakse ka teiste sidusrühmade ja teistsuguste kontekstide kohta saadud infot, kuna sealt võib saada positiivseid või hoiatavaid näiteid. Samuti on EbA meetodis oluline “ei tea” info, sest aitab teadvustada, mida tuleks kindlasti kasutajatega testimisel testida või edasi uurida.<br></br>Kui kasutate EbA meetodi töövahendit, kombineeritakse eeltingimuse olemasolu määra kirjeldav lause teile automaatselt. Lause kombineeritakse järgmiselt: Etappides 4.1-4.4 antud vastused annavad võimaluse 256 vastuste kombinatsiooniks. Igale kombinatsiooni sisuline tähendus väljendatakse ühe osana sellest lausest, mis kirjeldab, kuivõrd on eeltingimus täidetud. Kõik 256 lauset on leitavad sildi all “Kombineeritud vastused”. Juhul kui te ei kasuta EbA töövahendit, leidke 256 lause seast kombinatsioon, mis kattub 4.1-4.4 antud vastusega. Sellele lauseosale liidetakse Sidusrühm ja Funktsionaalsuse eeltingimus (vt joonis 6). Sidusrühm ja Funktsionaalsuse eeltingimus on täpselt samad, mille sisestasite eelnevalt etapis 2",
      "text2": "Kokku kombineeritud lauset võiks lugeda kui vastust küsimusele, mis tekkis, kui eelnevalt EbA meetodi töövahendisse panite kirja funktsionaalsuse eeltingimusi. Küsimus on: Kas + Sidusrühm + Eeltingimus? Vastuse saame, kui liidame kokku järgmise info: Kombinatsioon vastustest (vt sildi alt “Kombineeritud vastused“) + Sidusrühm + Eeltingimus. Kui kasutate EbA meetodi töövahendit, kuvatakse see vastus automaatselt.",
      "example": "Tuletame meelde, et meie funktsionaalsuse eeldus nr 1 tõstatas küsimuse Kas failide vastuvõtjad kasutavad samu tarkvaraprogramme kui kliendid? Pärast etappide 1-4 läbimist ülalpool kirjeldatud sisendiga annab EbA järgmise vastuse: “Eeltingimusega (failiformaatide kasutamine) ei olda rahul, kuid mõningal määral + failide vastuvõtjad + kasutavad samu tarkvaraprogramme kui kliendid”. Näide on kirjeldatud joonisel 7."
    },
    "step7": {
      "header": "Etapp 7. Tee järeldused ja loo tegevuskava",
      "text": "Pärast etappide 1-4 läbimist ja vajadusel ka näidete prioritiseerimist (etapp 5), lugege EbA meetodi kuvatud vastuseid (etapp 6). EbA meetod kombineeris vastused, mis  – tuginedes sidusrühma varasemale tegutsemisele  – kirjeldavad, mil määral on eeltingimused täidetud. Nende vastuste põhjal otsustage, kas eeldused on lahenduse edukaks toimimiseks piisavad või kui mitte, siis otsustage, mida teha, et olukorda parandada. Looge tegevuskava (vt joonis 8).<br></br>Kui eeldustingimusele on leitud näide, mille sihtrühm ja kontekst (osaliselt) kattuvad ning eesmärgipärane kasutus ja lahendusega rahulolu on saanud vastuse “Jah”, “Osaliselt” või “Ei”, saaksime seda lauset lugeda kui prognoosi kasutajate käitumise kohta meie loodavas tootes. Saate otsustada, kas funktsiooni eeldused on toote tõhusaks toimimiseks piisavalt olemas. Kui jah, annab see kindlust, et selles osas probleeme ei peaks ilmnema. Kui ei, siis leidke, mida võiks muuta, täiendada või teisiti teha. Kui analüüs viib selleni, et muudate toote lahenduses mõnd funktsionaalsust, tehke funktsionaalsuse uuendatud aspektile taas EbA analüüs.<br></br>Kui eeltingimusele võrdluseks toodud näide käib mõne teise sidusrühma või muu konteksti kohta, on teil võimalik ka sealt olulist infot saada. Näiteks, kui ühel teisel sidusrühmal pole eeltingimuse täitmisega probleeme ja nad on väga rahulolevad, siis oleks teil kasulik teada saada, mis on sealses kontekstis loonud sellise hea tulemuse ja kas sealt on midagi eeskujuks võtta. Ja vastupidi, kui eesmärgi saavutamise ja/või rahuloluga on probleeme, võiks seda olukorda analüüsida kui hoiatavat eeskuju. Teiste sidusrühmade või kontekstide näited ei võimalda siiski teha järeldusi meie sidusrühma ja konteksti kohta. Selleks tuleb planeerida kas täiendav analüüs või siis kasutajatega testimine.<br></br>Vastus “Ei tea” annab suunise eelduse olemasolu edasi uurida või märkida see ära kui miski, mida on vaja kasutajatega testimisel testida.<br></br>Eraldi tähelepanuga tasuks vaadata olukordi, kus eesmärgipärane kasutus on saanud vastuse “Jah”, kuid rahulolu vastuseks on “Ei”. See annab infot olukorrast, kus sidusrühm tegutseb nagu ette nähtud, kuid midagi tuleb enda süsteemis lahendada teisiti, et ennetada rahulolematuse tulva. Ja vastupidi, kui eesmärgipärane kasutus on saanud vastuse “Ei”, st tegutsemine pole eesmärgipärane, kuid rahulolu on positiivne ehk “Jah”, siis samasugust lahendust sama sidusrühma jaoks samal viisil pakkudes tähendab see suure tõenäosusega kellegi jaoks lisatööd.<br></br>Kui tegevuskava koostamise järel on soov saada ülevaadet, mis tüüpi tegevusi on vaja teha, kasutage taustavärvide abil kategoriseerimist. EbA töövahendis on kasutusel järgnevad tähendused ja värvikoodid:",
      "plan1": "Toimimise eeltingimus on täidetud e.“toimib”",
      "plan2": "Tehnoloogia poolt tuleb täiendada",
      "plan3": "Lahendus nii ei tööta, tuleb leida teistsugune lahendus",
      "plan4": "Lahendus vajab toetavat tegevust",
      "plan5": "Eeltingimus vajab testimist või täiendavat analüüsi",
      "plan6": "Muu otsus",
      "example": "Meie näites saab analüütik pärast kõigi kuue eeltingimuse analüüsimist otsustada, mida teha, et rahulolematuse aspekti parendada. Lahendust pakkudes on oluline jälgida, et see ei läheks vastuollu funktsionaalsuse ülejäänud eelduste tegevusplaaniga ning oleks kooskõlas kogu toote eesmärgiga. Teadmata selle funktsionaalsuse ülejäänud viie eelduse analüüsi tulemusi, võime hetkel otsustada, et rahulolematuse ennetamiseks võiks piirata failiformaate ning klientidele tuleks rakenduses kuvada, mis formaadid on lubatud."
    },
    "nb": {
      "header": "EbA meetodit kasutades tuleb silmas pidada järgmist:",
      "text": "<ol><li>EbA meetod aitab saada vastuseid sellele, mida küsitakse: vastavalt mida funktsionaalsustena sisestatakse ja eeldustena küsitakse – seda nii sisu kui ulatuse mõttes.</li><li>Analüüsi sisukus ja tegevuskava kvaliteet oleneb analüüsi tegija silmaringist ning võimekusest tuvastada seotud sidusrühmi, kirjeldada nende tegevusi planeeritavas tootes ja sidusrühmadelt eeldatud eeltingimusi.</li><li>Analüüsist saadud info kehtivus sõltub paljuski eeldusele (etapp 2) võrdluseks toodud näite situatsioonist (etapp 3) ning selle adekvaatsest hindamisest (etapp 4).</li></ol>"
    }
  },
  "questionnaires": "Küsimustikud",
  "et": "EST",
  "en": "ENG"
}
